{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 4], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "GarNet", "config": {"name": "gar_1", "trainable": true, "dtype": "float32", "collapse": null, "input_format": "xn", "discretize_distance": false, "mean_by_nvert": false, "n_aggregators": 4, "n_filters": 8, "n_propagate": 8}, "name": "gar_1", "inbound_nodes": [[["input_1", 0, 0, {}], ["input_2", 0, 0, {}]]]}, {"class_name": "GarNet", "config": {"name": "gar_2", "trainable": true, "dtype": "float32", "collapse": null, "input_format": "xn", "discretize_distance": false, "mean_by_nvert": false, "n_aggregators": 4, "n_filters": 8, "n_propagate": 8}, "name": "gar_2", "inbound_nodes": [[["gar_1", 0, 0, {}], ["input_2", 0, 0, {}]]]}, {"class_name": "GarNet", "config": {"name": "gar_3", "trainable": true, "dtype": "float32", "collapse": "mean", "input_format": "xn", "discretize_distance": false, "mean_by_nvert": false, "n_aggregators": 4, "n_filters": 8, "n_propagate": 8}, "name": "gar_3", "inbound_nodes": [[["gar_2", 0, 0, {}], ["input_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["gar_3", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["dense", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}